In [108]:
import pandas as pd
 
data = {'Name':['Tom191', 'nick256', 'krish356', 'jack456'],
        'Dates':['05032021','16032021','28032021','28032021']}
 
df1 = pd.DataFrame(data)

df1['Dates'] = pd.to_datetime(df1['Dates'], format='%d%m%Y')

In [109]:
data = {'Name':['Lucas1yu', 'nick2yu', 'krish3yu', 'jack4yu', 'jack5yu', 'jack6yu', 'Erika7yu', 'Joice8yu'],
        'Dates':['05032021','16032021','28032021','28032021', '05032021','16032021', '05032021', '16032021']}
 
df2 = pd.DataFrame(data)

df2['Dates'] = pd.to_datetime(df2['Dates'], format='%d%m%Y')

In [139]:
data = {'Name':['Zack', 'Luiza'],
        'Dates':['05032021','16032021'], 
        }
 
df3 = pd.DataFrame(data)

df3['Dates'] = pd.to_datetime(df3['Dates'], format='%d%m%Y')


data = {'Name':['Zack1', 'Luiza1', 'Zack2', 'Luiza2', 'Zack3', 'Luiza3', 'Zack1', 'Zack13', 'Zack14'],
        'Dates':['05032021','16032021', '05032021','16032021', '05032021','16032021','16032021','16032021','16032021'], 
        'Compra':[ 5, 10 , 21 , 6 , 7 , 1 , 11 , 1 , 11]
        }
 
df4 = pd.DataFrame(data)

df4['Dates'] = pd.to_datetime(df4['Dates'], format='%d%m%Y')


data = {'Name':['Zack16', 'Luiza16', 'Zack26', 'Luiza7', 'Zack9'],
        'Dates':['05032021','16032021', '05032021','16032021', '05032021'], 
        'Compra':[ 5, 10 , 21 , 6 , 7 ]
        }
 
df5 = pd.DataFrame(data)

df5['Dates'] = pd.to_datetime(df4['Dates'], format='%d%m%Y')

In [140]:
data_sets = [df1, df2, df3, df4]

In [142]:
df = pd.DataFrame()

df_0 = data_sets[0] 
len_df_0 = len(list(df_0['Name'].unique()))
mult0 = len_df_0  
df_total = pd.concat([df, df_0])

In [141]:
df = pd.DataFrame()

df_0 = data_sets[0] 
len_df_0 = len(list(df_0['Name'].unique()))
mult0 = len_df_0  
df_total = pd.concat([df, df_0])


df_1 = data_sets[1] 
df_1 = df_1[~df_1['Name'].isin(df_0['Name'].unique())]
len_df_1 = len(list(df_1['Name'].unique()))
mult1 = len_df_1  
df_total = pd.concat([df_total, df_1])
df_total = df_total.reset_index(inplace=True)


df_2 = data_sets[2] 
df_2 = df_2[~df_2['Name'].isin(df_total['Name'].unique())]
len_df_2 = len(list(df_2['Name'].unique()))
df_total = pd.concat([df_total, df_2])
df_total = df_total.reset_index(inplace=True)


mult_total = mult0 

print('Número de nomes adicionados ' , mult_total)
print( 'Novo dataframe devera ter ', mult_total + len_df_0 + len_df_1, ' nomes' )

df_4 = df4[~df4['Name'].isin(df_total['Name'].unique())]
df_4 = df_4.sort_values('Compra')
df_4 = df_4.reset_index(inplace=True)

print(df_total)

if len(list(df_4['Name'].unique())) <= mult_total:
    df_total = pd.concat([df_total, df_4])
    df_total = df_total.reset_index(inplace=True)
    #print("Executado")
    mult_total =  mult_total - len(list(df_4['Name'].unique()))
    print('Número de nomes  restantes ' , mult_total)
    print(df_total)

else:
    df_total = pd.concat([df_total, df_4[:mult_total]])
    print("Dataframe completo com ", len(df_total))

df_5 = df5[~df5['Name'].isin(df_total['Name'].unique())]
df_5 = df_5.sort_values('Compra')
df_5 = df_5.reset_index(inplace=True)

if len(list(df_5['Name'].unique())) <= mult_total:
    df_total = pd.concat([df_total, df_5])
    df_total = df_total.reset_index(inplace=True)
    print("Executado")
    mult_total =  mult_total - len(list(df_5['Name'].unique()))
    print('Número de nomes  restantes ' , mult_total)
else:
    #print("Não executado")
    df_total = pd.concat([df_total, df_5[:mult_total-2]])
    print("Dataframe completo com ", len(df_total['Name'].unique()))
    print(df_total)

TypeError: 'NoneType' object is not subscriptable

In [136]:
df_total.reset_index(inplace=True)

In [94]:
df_total

     Name      Dates  Compra
0     Tom 2021-03-05     NaN
1    nick 2021-03-16     NaN
2   krish 2021-03-28     NaN
3    jack 2021-03-28     NaN
0   Lucas 2021-03-05     NaN
6   Erika 2021-03-05     NaN
7   Joice 2021-03-16     NaN
0    Zack 2021-03-05     NaN
1   Luiza 2021-03-16     NaN
5  Luiza3 2021-03-16     1.0
7  Zack13 2021-03-16     1.0
0   Zack1 2021-03-05     5.0
3  Luiza2 2021-03-16     6.0
4   Zack3 2021-03-05     7.0
1  Luiza1 2021-03-16    10.0
6   Zack1 2021-03-16    11.0
8  Zack14 2021-03-16    11.0
2   Zack2 2021-03-05    21.0
0  Zack16 2021-03-05     5.0
3  Luiza7 2021-03-16     6.0
4   Zack9 2021-03-05     7.0

In [85]:
len(df_4)

9

In [73]:
len(list(df_4['Name'].unique()))

8

In [74]:
mult_total

7

In [75]:
df_total

    Name      Dates
0    Tom 2021-03-05
1   nick 2021-03-16
2  krish 2021-03-28
3   jack 2021-03-28
0  Lucas 2021-03-05
6  Erika 2021-03-05
7  Joice 2021-03-16
0   Zack 2021-03-05
1  Luiza 2021-03-16

In [46]:
df_2

    Name      Dates
0   Zack 2021-03-05
1  Luiza 2021-03-16

In [47]:
df_total

    Name      Dates
0    Tom 2021-03-05
1   nick 2021-03-16
2  krish 2021-03-28
3   jack 2021-03-28
0  Lucas 2021-03-05
6  Erika 2021-03-05
7  Joice 2021-03-16
0   Zack 2021-03-05
1  Luiza 2021-03-16

In [90]:
tamanho = 5
tamanho_dfs = len(list(set (list(df2['Name'].unique()) + list(df['Name'].unique()))))
d1_tam = 0.4 * 5
d2_tam = 0.6 * 5

In [91]:
if len(list(df['Name'].unique())) < d1_tam:
    df_final = df
else:
    interator = 1
    it = 0
    while it <  d1_tam  :
        interator = interator +1 
        df_iterator = df[:interator]
        it = len(list(df_iterator['Name'].unique()))
        print( df_iterator)

   Name      Dates
0   Tom 2021-03-05
1  nick 2021-03-16

In [92]:
df2 = df2[~df2['Name'].isin( df_iterator['Name'].unique())]

In [93]:
df_iterator['Name'].unique()

array(['Tom', 'nick'], dtype=object)

In [94]:
df2

    Name      Dates
0  Lucas 2021-03-05
2  krish 2021-03-28
3   jack 2021-03-28
4   jack 2021-03-05
5   jack 2021-03-16
6  Erika 2021-03-05
7  Joice 2021-03-16

In [95]:
if len(list(df2['Name'].unique())) < d2_tam:
    df_final = df2
else:
    interator = 1
    it = 0
    while it <  d2_tam  :
        interator = interator +1 
        df_iterator = df2[:interator]
        it = len(list(df_iterator['Name'].unique()))
        print( df_iterator)

    Name      Dates
0  Lucas 2021-03-05
2  krish 2021-03-28
    Name      Dates
0  Lucas 2021-03-05
2  krish 2021-03-28
3   jack 2021-03-28

In [96]:
df[:len(df['Name'])]

    Name      Dates
0    Tom 2021-03-05
1   nick 2021-03-16
2  krish 2021-03-28
3   jack 2021-03-28

In [97]:
d2_tam

3.0

In [98]:
import pandas as pd
 
# intialise data of lists.
data = {'Name':['Lucas', 'nick', 'krish', 'jack', 'jack', 'jack', 'Erika', 'Joice'],
        'Dates':['05032021','16032021','28032021','28032021', '05032021','16032021', '05032021', '16032021'],
        'Compra':[ 5, 10 , 21 , 6 , 7 , 1 , 11 , 10]       
        }
 
df3 = pd.DataFrame(data)

df3['Dates'] = pd.to_datetime(df3['Dates'], format='%d%m%Y')

In [99]:
df3 = df3[~df3['Name'].isin( df_iterator['Name'].unique())]

In [100]:
df3 = df3.sort_values('Compra')

In [101]:
df3

    Name      Dates  Compra
1   nick 2021-03-16      10
7  Joice 2021-03-16      10
6  Erika 2021-03-05      11

In [102]:
d3_tam = 4

In [103]:
if len(list(df3['Name'].unique())) < d3_tam:
    df_final = df3
else:
    interator = 1
    it = 0
    while it <  d3_tam  :
        interator = interator +1 
        df_iterator = df3[:interator]
        it = len(list(df_iterator['Name'].unique()))
        print( df_iterator)

In [105]:
df_final

    Name      Dates  Compra
1   nick 2021-03-16      10
7  Joice 2021-03-16      10
6  Erika 2021-03-05      11

In [106]:
import pandas as pd
 
# intialise data of lists.
data = {'Name':['Lucas', 'nick', 'krish', 'jack', 'jack', 'jack', 'Erika', 'Joice'],
        'Dates':['05032021','16032021','28032021','28032021', '05032021','16032021', '05032021', '16032021'],
        'Compra':[ 5, 10 , 21 , 6 , 7 , 1 , 11 , 10]       
        }
 
df3 = pd.DataFrame(data)

df3['Dates'] = pd.to_datetime(df3['Dates'], format='%d%m%Y')

df3 = df3.sort_values('Compra')

if len(list(df3['Name'].unique())) < d3_tam:
    df_final = df3
else:
    interator = 1
    it = 0
    while it <  d3_tam  :
        interator = interator +1 
        df_iterator = df3[:interator]
        it = len(list(df_iterator['Name'].unique()))
        print( df_iterator)

    Name      Dates  Compra
5   jack 2021-03-16       1
0  Lucas 2021-03-05       5
    Name      Dates  Compra
5   jack 2021-03-16       1
0  Lucas 2021-03-05       5
3   jack 2021-03-28       6
    Name      Dates  Compra
5   jack 2021-03-16       1
0  Lucas 2021-03-05       5
3   jack 2021-03-28       6
4   jack 2021-03-05       7
    Name      Dates  Compra
5   jack 2021-03-16       1
0  Lucas 2021-03-05       5
3   jack 2021-03-28       6
4   jack 2021-03-05       7
1   nick 2021-03-16      10
    Name      Dates  Compra
5   jack 2021-03-16       1
0  Lucas 2021-03-05       5
3   jack 2021-03-28       6
4   jack 2021-03-05       7
1   nick 2021-03-16      10
7  Joice 2021-03-16      10

In [ ]:
dfs =[]